import readapi
import time
import json

# api -> url: "api?ip=<xx>&key=<xx>"
# adv_api -> adv_url: "api?key=<xx>&ip=<xx>&type=4"
api = "https://restapi.amap.com/v3/ip"
adv_api = "https://restapi.amap.com/v5/ip/location"
apikey = ""    # 需要在高德开放平台注册申请
ip_list = [
    "101.229.60.41",
    "101.231.135.194",
    "101.67.164.146",
    "103.134.222.110",
    "103.151.173.102",
    "104.192.3.106",
    "104.194.10.143",
    "104.248.152.33",
    "106.117.115.240",
    "106.117.116.74",
    "107.189.10.12",
    "107.189.10.124",
    "109.105.210.102",
    "109.105.210.104",
    "110.185.78.201",
    "110.185.95.109",
    "111.225.214.208",
    "111.225.214.213",
    "111.37.19.84",
    "111.55.102.17",
    "115.242.166.190",
    "115.28.129.120",
    "116.179.33.11",
    "116.179.33.12",
    "117.176.201.73",
    "118.193.37.50",
    "118.26.111.107",
    "119.123.68.173",
    "45.79.211.97",
    "45.90.163.37",
    "46.151.178.13",
    "46.225.18.6",
    "47.128.110.73",
    "47.128.110.82",
    "47.128.62.60",
    "80.94.95.211",
    "80.94.95.83",
    "81.26.145.234",
    "8.208.10.94",
    "82.41.66.20",
    "86.48.1.198",
    "87.236.176.247",
    "88.151.33.187",
    "89.248.164.165",
    "91.196.152.186",
    "91.230.168.126",
    "91.231.89.197",
    "91.231.89.55",
]

'''
返回示例：
{
    "status":"1",
    "info":"OK",
    "infocode":"10000",
    "province":"上海市",
    "city":"上海市",
    "adcode":"310000",
    "rectangle":"120.8397067,30.77980118;122.1137989,31.66889673"
}
'''
def get_info_by_ip(ip, adv=False):
    url = api + "?ip=" + ip + "&key=" + apikey
    adv_url = api + ip + "?key=" + apikey + "&ip=" + "&type=4"
    if adv:
        resp = readapi.get(adv_url)
    else:
        resp = readapi.get(url)
    # print(resp.status_code)
    json_str = resp.text
    data: dict = json.loads(json_str)
    return data

if __name__ == '__main__':
    for ip in ip_list:
        pos = get_info_by_ip(ip)
        if pos["status"] != '0' and pos["adcode"]:
            print(pos)
        time.sleep(0.5)
        
